tests/Subscription/SubscriptionServiceTest/testPatchSubscription.yml


-
    request:
        method: GET
        url: 'http://wizaplace.loc/api/v1/users/authenticate'
        headers:
            Host: wizaplace.loc
            Accept-Encoding: null
            Authorization: 'Basic YWRtaW5Ad2l6YXBsYWNlLmNvbTpwYXNzd29yZA=='
            User-Agent: Wizaplace-PHP-SDK/dev-bugfix-WIZ-3593-unable-send-attachment@81a623c
            VCR-index: '0'
            Accept: null
    response:
        status:
            http_version: '1.1'
            code: '200'
            message: OK
        headers:
            Server: nginx
            Content-Type: application/json
            Transfer-Encoding: chunked
            Connection: keep-alive
            X-Powered-By: PHP/7.2.14
            Cache-Control: 'no-cache, private'
            Date: 'Wed, 18 Sep 2019 09:52:33 GMT'
            Content-Language: fr
            Access-Control-Allow-Origin: '*'
            X-Debug-Token: 87c4ac
            X-Debug-Token-Link: 'http://wizaplace.loc/_profiler/87c4ac'
            X-Request-Id: f6e89a7759f7567f8a96a147ba3a8a9d
        body: '{"id":2,"apiKey":"JCDBtlVr\/oaQVRMn94rcx0Q6XtPpuMPEqTvJprsF"}'
-
    request:
        method: PATCH
        url: 'http://wizaplace.loc/api/v1/subscriptions/2fe16ba9-42b7-4028-908f-677dce2f2b2d'
        headers:
            Host: wizaplace.loc
            Expect: null
            Accept-Encoding: null
            Content-Type: application/x-www-form-urlencoded
            User-Agent: Wizaplace-PHP-SDK/dev-bugfix-WIZ-3593-unable-send-attachment@81a623c
            Authorization: 'token JCDBtlVr/oaQVRMn94rcx0Q6XtPpuMPEqTvJprsF'
            VCR-index: '1'
            Accept: null
        body: 'status=DISABLED&isAutorenew=1'
    response:
        status:
            http_version: '1.1'
            code: '200'
            message: OK
        headers:
            Server: nginx
            Content-Type: application/json
            Transfer-Encoding: chunked
            Connection: keep-alive
            X-Powered-By: PHP/7.2.14
            Cache-Control: 'no-cache, private'
            Date: 'Wed, 18 Sep 2019 09:52:33 GMT'
            Content-Language: fr
            Access-Control-Allow-Origin: '*'
            X-Debug-Token: 4df990
            X-Debug-Token-Link: 'http://wizaplace.loc/_profiler/4df990'
            X-Request-Id: 0de630c4f6c49019c03f134c317f95b5
        body: '{"id":"2fe16ba9-42b7-4028-908f-677dce2f2b2d","userId":3,"companyId":3,"cardId":"f9fb753d-38d0-47b5-8e6c-9ff9df1e6288","firstOrderId":150001,"name":"Z11 Plus Bo\u00eetier PC en Acier ATX","status":"DISABLED","price":{"excludingTaxes":"979.43","taxes":"20.57","includingTaxes":"1000"},"isAutorenew":true,"commitmentPeriod":3,"paymentFrequency":3,"nextPaymentAt":"2019-12-18","commitmentEndAt":"2019-12-18","createdAt":"2019-09-18T08:16:39+02:00","items":[{"categoryId":3,"productId":1,"productCode":"978020137962","productName":"Z11 Plus Bo\u00eetier PC en Acier ATX","productIsRenewable":true,"declinationId":"1_2_2_7","unitPrice":{"excludingTaxes":"979.43","taxes":"20.57","includingTaxes":"1000"},"quantity":1,"totalPrice":{"excludingTaxes":"979.43","taxes":"20.57","includingTaxes":"1000"}}],"taxes":[{"taxId":2,"taxName":2,"amount":"20.57"}]}'
